atuin
bat
btop
carapace
coreutils
difftastic
eza
fd
fio
fish
gh
git-delta
gnupg
gum
lazydocker
lazygit
libyaml
mackup
macmon
mise
mysql-client
neovim
nushell
ouch
pkgconf
psviderski/tap/uncloud
pueue
rip2
rustscan
starship
tealdeer
television
ugit
uv
viddy
wget
xcodes
yazi
zellij
zoxide
