tap "homebrew/bundle"
tap "libsql/sqld"
tap "nikitabobko/tap"
tap "oh-my-home/fonts"
tap "sunnyyoung/repo"
tap "tursodatabase/tap"
brew "ca-certificates"
brew "libpng"
brew "freetype"
brew "openssl@3"
brew "pcre2"
brew "xz"
brew "cairo"
brew "certifi"
brew "gcc"
brew "python@3.12"
brew "aider"
brew "brotli"
brew "aom"
brew "c-ares"
brew "aribb24"
brew "assimp"
brew "atuin"
brew "autoconf"
brew "autocorrect"
brew "bash"
brew "bat"
brew "bore-cli"
brew "brainfuck"
brew "btop"
brew "cabextract"
brew "cfitsio"
brew "cgif"
brew "cjson"
brew "cloudflared"
brew "cmake"
brew "csvlens"
brew "curl"
brew "cyme"
brew "dav1d"
brew "dbus"
brew "docker"
brew "dra"
brew "duckdb"
brew "eget"
brew "exiftool"
brew "extra-cmake-modules"
brew "eza"
brew "fastfetch"
brew "fd"
brew "pango"
brew "sdl2"
brew "tesseract"
brew "ffmpeg"
brew "fftw"
brew "fpp"
brew "frps"
brew "fzf"
brew "genact"
brew "gfold"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "gitu"
brew "glow"
brew "goaccess"
brew "libtool"
brew "graphviz"
brew "grex"
brew "harlequin"
brew "pkgconf"
brew "hdf5"
brew "httm"
brew "httpie"
brew "hugo"
brew "hurl"
brew "hyperfine"
brew "iperf3"
brew "ipinfo-cli"
brew "iredis"
brew "jc"
brew "jd"
brew "jless"
brew "jq"
brew "juliaup"
brew "kondo"
brew "lazydocker"
brew "lazygit"
brew "libmagic"
brew "lnav"
brew "lua"
brew "luajit"
brew "lychee"
brew "macmon"
brew "media-info"
brew "mise"
brew "monolith"
brew "moreutils"
brew "neovim"
brew "nmap"
brew "nushell"
brew "ollama"
brew "onefetch"
brew "ouch"
brew "pandoc-crossref"
brew "parallel-disk-usage"
brew "platformio"
brew "postgresql@17"
brew "procs"
brew "pueue"
brew "python@3.11"
brew "rclone"
brew "redis"
brew "rip2"
brew "ripgrep"
brew "rustscan"
brew "scc"
brew "screenpipe"
brew "sd"
brew "shellcheck"
brew "smartmontools"
brew "sqlfluff"
brew "starship"
brew "tealdeer"
brew "termscp"
brew "tmux"
brew "tokei"
brew "typos-cli"
brew "typst"
brew "viddy"
brew "watchexec"
brew "wget"
brew "whisperkit-cli"
brew "yazi"
brew "yq"
brew "zellij"
brew "zola"
brew "zoxide"
brew "tursodatabase/tap/turso"
cask "1password-cli"
cask "aerospace"
cask "chromium"
cask "font-caskaydia-cove-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-smiley-sans"
cask "font-times-new-roman"
cask "ghostty"
cask "google-chrome"
cask "mactex"
cask "miniforge"
cask "otf-source-han-sans-sc"
cask "otf-source-han-serif-sc"
cask "surge"
cask "suspicious-package"
cask "syntax-highlight"
cask "uninstallpkg"
cask "wechattweak-cli"
cask "xcodes"
cask "xld"
cask "zed"
cask "zed@preview"
vscode "antfu.file-nesting"
vscode "boundary.baml-extension"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "denoland.vscode-deno"
vscode "dongfg.vscode-beancount-formatter"
vscode "dorzey.vscode-sqlfluff"
vscode "dotenv.dotenv-vscode"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "huacnlee.autocorrect"
vscode "ionutvmi.path-autocomplete"
vscode "jacobpfeifer.pfeifer-hurl"
vscode "james-yu.latex-workshop"
vscode "kahole.magit"
vscode "kdl-org.kdl"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lencerf.beancount"
vscode "marimo-team.vscode-marimo"
vscode "mechatroner.rainbow-csv"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "myriad-dreamin.tinymist"
vscode "ninoseki.vscode-mogami"
vscode "panekj.even-betterer-toml"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tecosaur.latex-utilities"
vscode "timonwong.shellcheck"
vscode "tobias-z.vscode-harpoon"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "ziglang.vscode-zig"
