aider
assimp
ast-grep
atuin
autocorrect
automake
awscli
bandwhich
bartib
basedpyright
bat
bats-core
bison
cfitsio
cgif
choose-rust
cmake
counts
csvlens
cyme
d2
datasette
difftastic
docker
doggo
dos2unix
duckdb
duf
extra-cmake-modules
eza
fastfetch
fd
fio
fisher
flex
flyctl
fossil
fpp
genact
gh
git
git-delta
git-extras
git-filter-repo
git-who
gitu
glow
goaccess
gotz
graphviz
grex
hdf5
helix
htop
httm
huggingface-cli
hyperfine
inlyne
ipinfo-cli
jaq
jc
jd
just
koji
lazydocker
lazygit
libmagic
llama.cpp
llm
lychee
mackup
macmon
make
mdq
media-info
miniserve
mise
monolith
mtr
neovim
nushell
oha
ollama
onefetch
openjdk
ouch
pandoc-crossref
parallel
parallel-disk-usage
pkl
poppler
postgresql@17
pre-commit
procs
pueue
py-spy
py3cairo
python-argcomplete
python@3.11
rargs
rclone
rip2
ripgrep-all
ripsecrets
rnr
ruff
rust-parallel
rustscan
screenpipe
sd
shellcheck
shfmt
smartmontools
spacer
sqlfluff
sqlite-utils
sshx
starship
tailspin
tealdeer
television
tmux
tokei
trippy
trzsz-go
typos-cli
typst
ugit
uv
viddy
watchexec
wget
whisperkit-cli
xh
yazi
zellij
zet
zoxide
