aider
assimp
ast-grep
atuin
autoconf
awscli
basedpyright
bat
bats-core
cfitsio
cgif
cmake
csvlens
cyme
d2
datasette
difftastic
docker
doggo
duckdb
extra-cmake-modules
eza
fastfetch
fio
flyctl
fossil
fpp
genact
gh
git
git-delta
git-extras
git-filter-repo
gitu
glow
gnupg
graphviz
grex
hdf5
helix
htop
httm
huggingface-cli
hyperfine
inlyne
ipinfo-cli
jc
lazydocker
lazygit
libmagic
llama.cpp
llm
mackup
macmon
media-info
mise
monolith
mtr
neovim
ollama
onefetch
openjdk
ouch
pandoc-crossref
pkl
postgresql@17
pre-commit
procs
py3cairo
python@3.11
rclone
rustscan
screenpipe
shellcheck
shfmt
smartmontools
sqlfluff
sqlite-utils
sshx
starship
tailspin
tealdeer
television
tmux
tokei
trippy
trzsz-go
typos-cli
typst
ugit
uv
viddy
wget
whisperkit-cli
xh
yazi
zellij
zoxide
