asciinema
ast-grep
atuin
awscli
bash
bat
beancount
beancount-language-server
blueutil
btop
carapace
coreutils
csvlens
difftastic
docker
duckdb
evil-helix
eza
fastfetch
fd
ffmpeg
fio
fish
flyctl
fpp
fzf
gh
git-delta
git-extras
git-filter-repo
git-lfs
gitu
glow
gnupg
gum
httm
hyperfine
jaq
jd
jj
jq
just
litecli
macmon
mdq
mise
mkcert
mongodb/brew/mongodb-community
mycli
mysql-client
neovim
nushell
ouch
ov
pandoc
parallel
parallel-disk-usage
pgcli
pkgconf
postgresql@18
procs
psviderski/tap/uncloud
pueue
rainfrog
rclone
riff
rip2
ripgrep
ruby
rust-parallel
rustscan
shellcheck
sqlfluff
sshx
starship
steipete/tap/peekaboo
tailspin
tealdeer
television
temporal
terminal-notifier
tmux
tokei
tree
trufflehog
trzsz-ssh
typst
uv
valkey
viddy
watchexec
wget
xh
yazi
yek
yq
zellij
zet
zoxide
zsh
