tap "homebrew/bundle"
tap "homebrew/services"
tap "libsql/sqld"
tap "nikitabobko/tap"
tap "oh-my-home/fonts"
tap "sunnyyoung/repo"
tap "tursodatabase/tap"
brew "ca-certificates"
brew "libpng"
brew "freetype"
brew "pcre2"
brew "openssl@3"
brew "xz"
brew "cairo"
brew "certifi"
brew "gcc"
brew "python@3.12"
brew "aider"
brew "brotli"
brew "aom"
brew "aribb24"
brew "assimp"
brew "ast-grep"
brew "atuin"
brew "autoconf"
brew "autocorrect"
brew "awscli"
brew "c-ares"
brew "basedpyright"
brew "bash"
brew "bat"
brew "bats-core"
brew "bore-cli"
brew "cfitsio"
brew "cgif"
brew "cjson"
brew "cmake"
brew "csvlens"
brew "cyme"
brew "d2"
brew "datasette"
brew "dav1d"
brew "detect-secrets"
brew "difftastic"
brew "docker"
brew "doggo"
brew "duckdb"
brew "eget"
brew "extra-cmake-modules"
brew "eza"
brew "fastfetch"
brew "fd"
brew "pango"
brew "sdl2"
brew "tesseract"
brew "ffmpeg"
brew "fio"
brew "flyctl"
brew "fossil"
brew "fpp"
brew "fzf"
brew "genact"
brew "gfold", link: false
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-filter-repo"
brew "git-lfs"
brew "gitu"
brew "glow"
brew "gnupg"
brew "libtool"
brew "graphviz"
brew "grex"
brew "pkgconf"
brew "hdf5"
brew "htop"
brew "httm"
brew "huggingface-cli"
brew "hurl"
brew "hyperfine"
brew "ipinfo-cli"
brew "jc"
brew "jless"
brew "jq"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "libmagic"
brew "llama.cpp"
brew "llm"
brew "lua"
brew "luajit"
brew "lychee"
brew "mackup"
brew "macmon"
brew "media-info"
brew "mise"
brew "monolith"
brew "mtr"
brew "neovim"
brew "nmap"
brew "ollama", restart_service: :changed
brew "onefetch"
brew "openjdk"
brew "ouch"
brew "pandoc-crossref"
brew "parallel"
brew "parallel-disk-usage"
brew "pkl"
brew "postgresql@17"
brew "pre-commit"
brew "procs"
brew "pueue"
brew "py3cairo"
brew "python@3.11"
brew "rclone"
brew "rip2"
brew "ripgrep"
brew "ruff"
brew "rustscan"
brew "screenpipe"
brew "shellcheck"
brew "shfmt"
brew "smartmontools"
brew "sqlfluff"
brew "sqlite-utils"
brew "sshx"
brew "starship"
brew "tailspin"
brew "tealdeer"
brew "television"
brew "tmux"
brew "tokei"
brew "trippy"
brew "trzsz-go"
brew "typos-cli"
brew "typst"
brew "ugit"
brew "uv"
brew "viddy"
brew "wget"
brew "whisperkit-cli"
brew "xh"
brew "yazi"
brew "zellij"
brew "zoxide"
cask "1password-cli"
cask "aerospace"
cask "font-jetbrains-mono-nerd-font"
cask "font-smiley-sans"
cask "ghostty"
cask "google-chrome"
cask "mactex"
cask "miniforge"
cask "orbstack"
cask "otf-source-han-sans-sc"
cask "otf-source-han-serif-sc"
cask "surge"
cask "suspicious-package"
cask "syntax-highlight"
cask "uninstallpkg"
cask "wechattweak-cli"
cask "xcodes"
cask "xld"
cask "zed"
vscode "antfu.file-nesting"
vscode "anysphere.pyright"
vscode "boundary.baml-extension"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "dongfg.vscode-beancount-formatter"
vscode "dorzey.vscode-sqlfluff"
vscode "dotenv.dotenv-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "huacnlee.autocorrect"
vscode "ionutvmi.path-autocomplete"
vscode "james-yu.latex-workshop"
vscode "kdl-org.kdl"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lencerf.beancount"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "myriad-dreamin.tinymist"
vscode "ninoseki.vscode-mogami"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "tecosaur.latex-utilities"
vscode "terrastruct.d2"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "ziglang.vscode-zig"
