42ailab/42plugin/forty-two-plugin
antoniorodr/memo/memo
asciinema
ast-grep
awscli
bash-completion@2
bat
beancount
beancount-language-server
blueutil
btop
carapace
cirruslabs/cli/tart
coreutils
csvlens
difftastic
docker
duckdb
evil-helix
eza
fastfetch
fd
ffmpeg
fio
fish
flock
flyctl
fpp
geesefs
gemini-cli
gh
git-delta
git-extras
git-filter-repo
git-lfs
gitu
glow
gum
hashicorp/tap/packer
httm
hyperfine
jademind/tap/pi-statusbar
jaq
jd
jjui
jq
just
litecli
mactop
mdq
minorole/tap/gpane
mise
mkcert
mongodb/brew/mongodb-community
mycli
mysql-client
neovim
nexttrace
nushell
opam
ouch
ov
pandoc-crossref
parallel
parallel-disk-usage
pgcli
pkgconf
pngquant
poppler
postgresql@18
procs
pscale
pueue
qpdf
rainfrog
rclone
riff
rip2
rust-parallel
rustscan
sesh
shellcheck
sk
somo
sqlfluff
sshx
starship
steipete/tap/peekaboo
tailspin
tealdeer
television
temporal
terminal-notifier
tmux
tokei
trippy
trufflehog
trzsz-ssh
typst
unison
uv
valkey
viddy
watchexec
wget
withgraphite/tap/graphite
xh
yakitrak/yakitrak/obsidian-cli
yazi
yek
yq
zellij
zet
zoxide
