tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "asdf"
brew "commitizen"
brew "diff-so-fancy"
brew "fzf"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gitui"
brew "htop"
brew "jq"
brew "lazydocker"
brew "lsd"
brew "mackup"
brew "neovim"
brew "pipx"
brew "pyenv"
brew "ripgrep"
brew "rm-improved"
brew "ssh-copy-id"
brew "starship"
brew "tealdeer"
brew "tmux"
brew "wget"
brew "zoxide"
cask "font-caskaydia-cove-nerd-font"
