tap "1password/tap"
tap "borkdude/brew"
tap "brimdata/tap"
tap "buo/cask-upgrade"
tap "candid82/brew"
tap "cloudflare/cloudflare"
tap "d12frosted/emacs-plus"
tap "deb-sig/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "majd/repo"
tap "martido/graph"
tap "noborus/tap"
tap "oh-my-home/fonts"
tap "railwaycat/emacsmacport"
tap "robotsandpencils/made"
tap "sunnyyoung/repo"
tap "timothyye/tap"
tap "zurawiki/brews"
brew "libpng"
brew "xz"
brew "openssl@3"
brew "aria2"
brew "asciinema"
brew "autoconf"
brew "coreutils"
brew "asdf"
brew "atuin"
brew "autocorrect"
brew "awscli"
brew "python@3.10"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bazelisk"
brew "bore-cli"
brew "bottom"
brew "broot"
brew "freetype"
brew "pcre2"
brew "pkg-config"
brew "cairo"
brew "pango"
brew "chafa"
brew "cheat"
brew "choose-rust"
brew "ciphey"
brew "cmake"
brew "colima"
brew "curl"
brew "dasel"
brew "difftastic"
brew "direnv"
brew "docker"
brew "dog"
brew "duf"
brew "dust"
brew "exiftool"
brew "extra-cmake-modules"
brew "fcp"
brew "fd"
brew "sdl2"
brew "ffmpeg"
brew "gcc"
brew "fftw"
brew "flyctl"
brew "fpp"
brew "frps"
brew "fswatch"
brew "fzf"
brew "gh"
brew "git"
brew "git-cliff"
brew "git-crypt"
brew "git-extras", link: false
brew "git-lfs"
brew "git-quick-stats"
brew "glow"
brew "gnupg"
brew "gping"
brew "jpeg", link: true
brew "graphviz"
brew "grex"
brew "hdf5"
brew "htop"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "iperf"
brew "ipinfo-cli"
brew "jc"
brew "jq"
brew "juliaup"
brew "just"
brew "latexindent"
brew "lazydocker"
brew "lazygit"
brew "lf"
brew "libmagic"
brew "llvm"
brew "lnav"
brew "lsd"
brew "luajit"
brew "m-cli"
brew "mas"
brew "media-info"
brew "monolith"
brew "navi"
brew "ncdu"
brew "neovim"
brew "neovide"
brew "nmap"
brew "node"
brew "pdfgrep"
brew "php"
brew "pipx"
brew "platformio"
brew "procs"
brew "pueue"
brew "pyenv"
brew "qt"
brew "ripgrep"
brew "rm-improved"
brew "sd"
brew "sevenzip"
brew "shellcheck"
brew "sk"
brew "smartmontools"
brew "ssh-copy-id"
brew "starship"
brew "t-rec"
brew "tealdeer"
brew "thefuck"
brew "tmate"
brew "tmux"
brew "tokei"
brew "tor"
brew "tree"
brew "typos-cli"
brew "typst"
brew "ugit"
brew "vips"
brew "watchexec"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zig"
brew "zola"
brew "zoxide"
brew "borkdude/brew/babashka"
brew "brimdata/tap/zed"
brew "brimdata/tap/zq"
brew "cloudflare/cloudflare/cloudflared"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp", "with-nobu417-big-sur-icon"]
brew "deb-sig/tap/double-entry-generator"
brew "noborus/tap/ov"
brew "timothyye/tap/skm"
brew "zurawiki/brews/gptcommit"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "apparency"
cask "chromium"
cask "clashx-pro"
cask "devtoys"
cask "espanso"
cask "fig"
cask "font-caskaydia-cove-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-times-new-roman"
cask "google-cloud-sdk"
cask "ipatool"
cask "latest"
cask "logseq"
cask "mactex"
cask "miniforge"
cask "obsidian"
cask "openemu"
cask "powershell"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlvideo"
cask "squirrel"
cask "suspicious-package"
cask "syntax-highlight"
cask "topnotch"
cask "tunnelblick"
cask "uninstallpkg"
cask "visual-studio-code"
cask "wechattweak-cli"
cask "xcodes"
cask "xld"
cask "zerotier-one"
cask "zulu17"
cask "zulu8"
mas "1Password for Safari", id: 1569813296
mas "Bob", id: 1630034110
mas "Compressor", id: 424390742
mas "Darkroom", id: 953286746
mas "Day One", id: 1055511498
mas "DevCleaner", id: 1388020431
mas "Developer", id: 640199958
mas "Drafts", id: 1435957248
mas "Eagle for Safari", id: 1526651672
mas "Exporter", id: 1099120373
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Maipo", id: 789066512
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Motion", id: 434290957
mas "MusicHarbor", id: 1440405750
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "OpenCat", id: 6445999201
mas "Pages", id: 409201541
mas "PasteNow", id: 1552536109
mas "Picsee", id: 1454805783
mas "Pixea", id: 1507782672
mas "PocketTube", id: 1533703891
mas "Save to Raindrop.io", id: 1549370672
mas "ServerCat", id: 1501532023
mas "Shapr3D", id: 1091675654
mas "Slack", id: 803453959
mas "Tampermonkey", id: 1482490089
mas "Todoist", id: 585829637
mas "Tonal", id: 6449281141
mas "uBlacklist for Safari", id: 1547912640
mas "uPic", id: 1549159979
mas "Vimari", id: 1480933944
mas "waifu2x", id: 1286485858
mas "讯飞语音输入", id: 1243368435
vscode "antfu.file-nesting"
vscode "antfu.slidev"
vscode "aster.vscode-subtitles"
vscode "bierner.markdown-mermaid"
vscode "bodil.file-browser"
vscode "Catppuccin.catppuccin-vsc"
vscode "codeandstuff.package-json-upgrade"
vscode "codezombiech.gitignore"
vscode "darkriszty.markdown-table-prettify"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "dongfg.vscode-beancount-formatter"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "EdwinKofler.vscode-assorted-languages"
vscode "emilast.LogFileHighlighter"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "Gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "huacnlee.autocorrect"
vscode "ionutvmi.path-autocomplete"
vscode "jacobdufault.fuzzy-search"
vscode "James-Yu.latex-workshop"
vscode "julialang.language-julia"
vscode "kahole.magit"
vscode "KevinRose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "Lencerf.beancount"
vscode "LeonardSSH.vscord"
vscode "lmql-team.lmql"
vscode "marp-team.marp-vscode"
vscode "mathiassoeholm.markdown-link-updater"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "ninoseki.vscode-pylens"
vscode "njpwerner.autodocstring"
vscode "nvarner.typst-lsp"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "qezhu.gitlink"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "REditorSupport.r"
vscode "Rickaym.manim-sideview"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sirmspencer.vscode-autohide"
vscode "skn0tt.markdown-link-expander"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tecosaur.latex-utilities"
vscode "telesoho.vscode-markdown-paste-image"
vscode "timonwong.shellcheck"
vscode "Tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "vscodevim.vim"
vscode "VSpaceCode.vspacecode"
vscode "VSpaceCode.whichkey"
vscode "wayou.vscode-todo-highlight"
vscode "yy0931.save-as-root"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
