tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "asdf"
brew "broot"
brew "direnv"
brew "fd"
brew "fzf"
brew "git"
brew "htop"
brew "lsd"
brew "mackup"
brew "neovim"
brew "pipx"
brew "ripgrep"
brew "rm-improved"
brew "ssh-copy-id"
brew "starship"
brew "tealdeer"
brew "thefuck"
brew "tmux"
brew "zoxide"
cask "alacritty"
cask "chromium"
cask "font-caskaydia-cove-nerd-font"
cask "iterm2"
cask "visual-studio-code"
