tap "1password/tap"
tap "appleboy/tap"
tap "borkdude/brew"
tap "brimdata/tap"
tap "buo/cask-upgrade"
tap "candid82/brew"
tap "d12frosted/emacs-plus"
tap "deb-sig/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "majd/repo"
tap "martido/graph"
tap "modularml/packages"
tap "nikitabobko/tap"
tap "noborus/tap"
tap "oh-my-home/fonts"
tap "oven-sh/bun"
tap "railwaycat/emacsmacport"
tap "robotsandpencils/made"
tap "sunnyyoung/repo"
tap "timothyye/tap"
tap "zeabur/tap"
tap "zurawiki/brews"
brew "libpng"
brew "xz"
brew "openssl@3"
brew "aria2"
brew "asciinema"
brew "autoconf"
brew "coreutils"
brew "asdf"
brew "atuin"
brew "autocorrect"
brew "python@3.11"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bazelisk"
brew "bore-cli"
brew "bottom"
brew "broot"
brew "freetype"
brew "pcre2"
brew "cairo"
brew "pango"
brew "chafa"
brew "cheat"
brew "choose-rust"
brew "cloudflared"
brew "cmake"
brew "cocoapods"
brew "colima"
brew "curl"
brew "dasel"
brew "difftastic"
brew "direnv"
brew "docker"
brew "duf"
brew "dust"
brew "exiftool"
brew "extra-cmake-modules"
brew "fcp"
brew "fd"
brew "gcc"
brew "sdl2"
brew "ffmpeg"
brew "fftw"
brew "flyctl"
brew "fpp"
brew "frps"
brew "fswatch"
brew "fzf"
brew "genact"
brew "gh"
brew "git"
brew "git-cliff"
brew "git-crypt"
brew "git-extras", link: false
brew "git-lfs"
brew "git-quick-stats"
brew "glow"
brew "gnupg"
brew "gping"
brew "graphviz"
brew "grex"
brew "pkg-config"
brew "hdf5"
brew "htop"
brew "httpie"
brew "hugo"
brew "hurl"
brew "hyperfine"
brew "imagemagick"
brew "iperf"
brew "iperf3"
brew "ipinfo-cli"
brew "jc"
brew "jpeg"
brew "jq"
brew "juliaup"
brew "just"
brew "latexindent"
brew "lazydocker"
brew "lazygit"
brew "lf"
brew "libmagic"
brew "llvm"
brew "lnav"
brew "lsd"
brew "luajit"
brew "m-cli"
brew "mas"
brew "media-info"
brew "monolith"
brew "moreutils"
brew "navi"
brew "ncdu"
brew "neovim"
brew "neovide"
brew "nmap"
brew "node"
brew "ollama"
brew "pandoc-crossref"
brew "pdfgrep"
brew "php"
brew "pipx"
brew "platformio"
brew "procs"
brew "pueue"
brew "pyenv"
brew "python@3.10"
brew "qt"
brew "ripgrep"
brew "rm-improved"
brew "sd"
brew "sevenzip"
brew "shellcheck"
brew "sk"
brew "smartmontools"
brew "ssh-copy-id"
brew "starship"
brew "t-rec"
brew "tealdeer"
brew "thefuck"
brew "tmate"
brew "tmux"
brew "tmuxp"
brew "tokei"
brew "tor"
brew "tree"
brew "typos-cli"
brew "typst"
brew "ugit"
brew "vips"
brew "watchexec"
brew "wgcf"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zig"
brew "zola"
brew "zoxide"
brew "appleboy/tap/codegpt"
brew "borkdude/brew/babashka"
brew "brimdata/tap/zq"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp", "with-nobu417-big-sur-icon"]
brew "deb-sig/tap/double-entry-generator"
brew "modularml/packages/modular"
brew "noborus/tap/ov"
brew "oven-sh/bun/bun"
brew "timothyye/tap/skm"
brew "zeabur/tap/cli"
brew "zurawiki/brews/gptcommit"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "apparency"
cask "clashx-pro"
cask "devtoys"
cask "firefox-beta"
cask "font-caskaydia-cove-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-smiley-sans"
cask "font-times-new-roman"
cask "fsnotes"
cask "google-cloud-sdk"
cask "logseq"
cask "mactex"
cask "miniforge"
cask "mysql-shell"
cask "obsidian"
cask "powershell"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlvideo"
cask "surge"
cask "suspicious-package"
cask "syntax-highlight"
cask "tailscale"
cask "tunnelblick"
cask "uninstallpkg"
cask "visual-studio-code"
cask "wechattweak-cli"
cask "xcodes"
cask "xld"
cask "zulu21"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Avenue", id: 1523681067
mas "Bear", id: 1091189122
mas "Bob", id: 1630034110
mas "CapCut", id: 1500855883
mas "Compressor", id: 424390742
mas "Day One", id: 1055511498
mas "DevCleaner", id: 1388020431
mas "Developer", id: 640199958
mas "Dice", id: 1479250666
mas "Drafts", id: 1435957248
mas "Eagle for Safari", id: 1526651672
mas "Endel", id: 1346247457
mas "Exporter", id: 1099120373
mas "Final Cut Pro", id: 424389933
mas "Flighty", id: 1358823008
mas "flomo", id: 1665341561
mas "Folder Hub", id: 6473019059
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "Hush", id: 1544743900
mas "Immersive Translate", id: 6447957425
mas "iMovie", id: 408981434
mas "Jetpack 2", id: 1598096399
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Maipo", id: 789066512
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Mini Metro+", id: 1550663539
mas "Motion", id: 434290957
mas "MusicHarbor", id: 1440405750
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "PasteNow", id: 1552536109
mas "Photomator", id: 1444636541
mas "Planny", id: 1515324201
mas "PocketTube", id: 1533703891
mas "RSSHub Radar", id: 1610744717
mas "Save to Raindrop.io", id: 1549370672
mas "Save to Reader", id: 1640236961
mas "Shapr3D", id: 1091675654
mas "Slack", id: 803453959
mas "Stickies Pro", id: 1482080766
mas "Surfingkeys", id: 1609752330
mas "Tampermonkey", id: 1482490089
mas "TickTick", id: 966085870
mas "Tonal", id: 6449281141
mas "uBlacklist for Safari", id: 1547912640
mas "uPic", id: 1549159979
mas "Whisper Transcription", id: 1668083311
vscode "antfu.file-nesting"
vscode "antfu.slidev"
vscode "aster.vscode-subtitles"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "bodil.file-browser"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "codeandstuff.package-json-upgrade"
vscode "codezombiech.gitignore"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "dongfg.vscode-beancount-formatter"
vscode "draivin.hscopes"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "edwinkofler.vscode-assorted-languages"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-highlight"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "huacnlee.autocorrect"
vscode "ionutvmi.path-autocomplete"
vscode "jacobdufault.fuzzy-search"
vscode "jacobpfeifer.pfeifer-hurl"
vscode "james-yu.latex-workshop"
vscode "julialang.language-julia"
vscode "kahole.magit"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lehoanganh298.json-lines-viewer"
vscode "lencerf.beancount"
vscode "lmql-team.lmql"
vscode "marimo-team.vscode-marimo"
vscode "marp-team.marp-vscode"
vscode "mathiassoeholm.markdown-link-updater"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "myriad-dreamin.tinymist"
vscode "naumovs.color-highlight"
vscode "ninoseki.vscode-pylens"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "qezhu.gitlink"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "rickaym.manim-sideview"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "skn0tt.markdown-link-expander"
vscode "tamasfe.even-better-toml"
vscode "tecosaur.latex-utilities"
vscode "telesoho.vscode-markdown-paste-image"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "yy0931.save-as-root"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
