tap "homebrew/bundle"
tap "homebrew/services"
tap "libsql/sqld"
tap "modularml/packages"
tap "oh-my-home/fonts"
tap "sunnyyoung/repo"
tap "tursodatabase/tap"
tap "vladkens/tap"
brew "libpng"
brew "xz"
brew "openssl@3"
brew "aria2"
brew "asciinema"
brew "atuin"
brew "autoconf"
brew "autocorrect"
brew "bash"
brew "bat"
brew "bazelisk"
brew "bore-cli"
brew "bottom"
brew "broot"
brew "btop"
brew "cabextract"
brew "freetype"
brew "pcre2"
brew "cairo"
brew "pango"
brew "chafa"
brew "choose-rust"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "cyme"
brew "dasel"
brew "difftastic"
brew "docker"
brew "duf"
brew "dust"
brew "eget"
brew "exiftool"
brew "extra-cmake-modules"
brew "eza"
brew "fastfetch"
brew "fcp"
brew "fd"
brew "sdl2"
brew "tesseract"
brew "ffmpeg"
brew "gcc"
brew "fftw"
brew "flyctl"
brew "libtool"
brew "fontforge"
brew "fzf"
brew "forgit"
brew "fpp"
brew "frps"
brew "fswatch"
brew "gdu"
brew "genact"
brew "gh"
brew "git"
brew "git-cliff"
brew "git-crypt"
brew "git-delta"
brew "git-extras", link: false
brew "git-lfs"
brew "git-quick-stats"
brew "glow"
brew "gnupg"
brew "gping"
brew "graphviz"
brew "grex"
brew "halp"
brew "pkg-config"
brew "hdf5"
brew "htop"
brew "httpie"
brew "hugo"
brew "hurl"
brew "hyperfine"
brew "imagemagick"
brew "iperf"
brew "iperf3"
brew "ipinfo-cli"
brew "jc"
brew "jd"
brew "jless"
brew "jpeg"
brew "jq"
brew "juliaup"
brew "just"
brew "kondo"
brew "latexindent"
brew "lazydocker"
brew "lazygit"
brew "lf"
brew "libmagic"
brew "llama.cpp"
brew "llvm"
brew "lnav"
brew "lua"
brew "luajit"
brew "m-cli"
brew "mactop"
brew "mas"
brew "media-info"
brew "mise"
brew "monolith"
brew "moreutils"
brew "ncdu"
brew "node"
brew "neonctl"
brew "neovim"
brew "nmap"
brew "nnn"
brew "nushell"
brew "ollama"
brew "onefetch"
brew "ouch"
brew "pandoc-crossref"
brew "pdfgrep"
brew "pipx"
brew "platformio"
brew "procs"
brew "promptfoo"
brew "pueue"
brew "pyenv"
brew "python@3.11"
brew "qt"
brew "ripgrep"
brew "rm-improved"
brew "scc"
brew "sd"
brew "sevenzip"
brew "shellcheck"
brew "sk"
brew "smartmontools"
brew "ssh-copy-id"
brew "starship"
brew "superfile"
brew "t-rec"
brew "tealdeer"
brew "tmate"
brew "tmux"
brew "tmuxp"
brew "tokei"
brew "topgrade"
brew "tor"
brew "tree"
brew "trippy"
brew "trufflehog"
brew "typos-cli"
brew "typst"
brew "ugit"
brew "vips"
brew "watchexec"
brew "wgcf"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zellij"
brew "zig"
brew "zola"
brew "zoxide"
brew "modularml/packages/modular"
brew "tursodatabase/tap/turso"
brew "vladkens/tap/macmon"
cask "1password-cli"
cask "alacritty"
cask "apparency"
cask "bbackupp"
cask "chromium"
cask "firefox@nightly"
cask "font-caskaydia-cove-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-smiley-sans"
cask "font-times-new-roman"
cask "mactex"
cask "miniforge"
cask "otf-source-han-sans-sc"
cask "otf-source-han-serif-sc"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlvideo"
cask "surge"
cask "suspicious-package"
cask "syntax-highlight"
cask "tunnelblick"
cask "uninstallpkg"
cask "wechattweak-cli"
cask "xcodes"
cask "xld"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Avenue", id: 1523681067
mas "Balatro", id: 6502451661
mas "Bob", id: 1630034110
mas "CapCut", id: 1500855883
mas "com.kagimacOS.Kagi-Search", id: 1622835804
mas "Compressor", id: 424390742
mas "Day One", id: 1055511498
mas "DevCleaner", id: 1388020431
mas "Developer", id: 640199958
mas "Dice", id: 1479250666
mas "Drafts", id: 1435957248
mas "Eagle for Safari", id: 1526651672
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "Hush", id: 1544743900
mas "Immersive Translate", id: 6447957425
mas "iMovie", id: 408981434
mas "Jetpack 2", id: 1598096399
mas "Keynote", id: 409183694
mas "Klack", id: 6446206067
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Mini Metro+", id: 1550663539
mas "Motion", id: 434290957
mas "MusicHarbor", id: 1440405750
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "PasteNow", id: 1552536109
mas "Photomator", id: 1444636541
mas "Planny", id: 1515324201
mas "PocketTube", id: 1533703891
mas "RSSHub Radar", id: 1610744717
mas "Save to Raindrop.io", id: 1549370672
mas "Save to Reader", id: 1640236961
mas "Shapr3D", id: 1091675654
mas "Slack", id: 803453959
mas "Surfingkeys", id: 1609752330
mas "Tailscale", id: 1475387142
mas "Tampermonkey", id: 1482490089
mas "Tonal", id: 6449281141
mas "uBlacklist for Safari", id: 1547912640
mas "uPic", id: 1549159979
mas "WeCom", id: 1189898970
vscode "antfu.file-nesting"
vscode "bodil.file-browser"
vscode "boundary.baml-extension"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "dongfg.vscode-beancount-formatter"
vscode "editorconfig.editorconfig"
vscode "edwinkofler.vscode-assorted-languages"
vscode "emilast.logfilehighlighter"
vscode "formulahendry.code-runner"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "ionutvmi.path-autocomplete"
vscode "jacobdufault.fuzzy-search"
vscode "jacobpfeifer.pfeifer-hurl"
vscode "james-yu.latex-workshop"
vscode "kahole.magit"
vscode "kdl-org.kdl"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lencerf.beancount"
vscode "marimo-team.vscode-marimo"
vscode "mechatroner.rainbow-csv"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "myriad-dreamin.tinymist"
vscode "ninoseki.vscode-mogami"
vscode "oderwat.indent-rainbow"
vscode "panekj.even-betterer-toml"
vscode "percy.vscode-numpy-viewer"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "sumneko.lua"
vscode "tecosaur.latex-utilities"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
