aaron-bond.better-comments
AffenWiesel.matlab-formatter
alefragnani.Bookmarks
alefragnani.project-manager
antfu.file-nesting
antfu.slidev
antfu.smart-clicks
aster.vscode-subtitles
asvetliakov.vscode-neovim
benjamin-simmonds.pythoncpp-debug
betterthantomorrow.calva
bierner.markdown-mermaid
bodil.file-browser
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
codeandstuff.package-json-upgrade
cschleiden.vscode-github-actions
csholmq.excel-to-markdown-table
darkriszty.markdown-table-prettify
DavidAnson.vscode-markdownlint
dbaeumer.jshint
dbaeumer.vscode-eslint
deerawan.vscode-dash
dendron.dendron
dendron.dendron-markdown-shortcuts
dendron.dendron-paste-image
dnicolson.binary-plist
dongfg.vscode-beancount-formatter
donjayamanne.githistory
eamodio.gitlens
eg2.vscode-npm-script
esbenp.prettier-vscode
felipecaputo.git-project-manager
firefox-devtools.vscode-firefox-debug
foam.foam-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
foxundermoon.shell-format
Gimly81.matlab
ginfuru.ginfuru-better-solarized-dark-theme
GitHub.codespaces
GitHub.copilot
GitHub.copilot-labs
GitHub.vscode-pull-request-github
GitLab.gitlab-workflow
golang.go
GrapeCity.gc-excelviewer
GraphQL.vscode-graphql
Gruntfuggly.todo-tree
hediet.vscode-drawio
herrmannplatz.npm-dependency-links
huacnlee.auto-correct
humao.rest-client
ionutvmi.path-autocomplete
jacobdufault.fuzzy-search
James-Yu.latex-workshop
jebbs.plantuml
jeff-hykin.better-cpp-syntax
jock.svg
julialang.language-julia
kahole.magit
KevinRose.vsc-python-indent
kisstkondoros.vscode-gutter-preview
KnisterPeter.vscode-commitizen
Lencerf.beancount
mads-hartmann.bash-ide-vscode
marp-team.marp-vscode
mathiassoeholm.markdown-link-updater
mattn.Lisp
mechatroner.rainbow-csv
mervin.markdown-formatter
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.powershell
mshr-h.veriloghdl
msjsdiag.vscode-react-native
naumovs.color-highlight
ninoseki.vscode-pylens
njpwerner.autodocstring
NomicFoundation.hardhat-solidity
nortakales.vs-qalc
oderwat.indent-rainbow
piersdeseilligny.betterfountain
PKief.material-icon-theme
platformio.platformio-ide
pomdtr.excalidraw-editor
qezhu.gitlink
rebornix.ruby
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
REditorSupport.r
Remisa.shellman
Rickaym.manim-sideview
ritwickdey.LiveServer
rogalmic.bash-debug
rust-lang.rust-analyzer
seanwu.vscode-qt-for-python
serayuzgur.crates
shd101wyy.markdown-preview-enhanced
silvenon.mdx
skn0tt.markdown-link-expander
spencerwoo.vscode-sspai-markdown-helper
sswg.swift-lang
streetsidesoftware.code-spell-checker
sumneko.lua
tamasfe.even-better-toml
tecosaur.latex-utilities
telesoho.vscode-markdown-paste-image
timonwong.shellcheck
twxs.cmake
Tyriar.sort-lines
usernamehw.errorlens
vadimcn.vscode-lldb
vintharas.learn-vim
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscodevim.vim
VSpaceCode.vspacecode
VSpaceCode.whichkey
Vue.volar
wingrunr21.vscode-ruby
XING.zotero-cite
yinfei.luahelper
yy0931.save-as-root
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
