aaron-bond.better-comments
antfu.file-nesting
antfu.slidev
antfu.smart-clicks
arcanis.vscode-zipfs
aster.vscode-subtitles
BazelBuild.vscode-bazel
benjamin-simmonds.pythoncpp-debug
betterthantomorrow.calva
bierner.markdown-mermaid
bodil.file-browser
codeandstuff.package-json-upgrade
codezombiech.gitignore
cschleiden.vscode-github-actions
csholmq.excel-to-markdown-table
darkriszty.markdown-table-prettify
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
dnicolson.binary-plist
dongfg.vscode-beancount-formatter
eamodio.gitlens
EditorConfig.EditorConfig
emilast.LogFileHighlighter
esbenp.prettier-vscode
formulahendry.code-runner
foxundermoon.shell-format
GitHub.copilot
GitHub.copilot-labs
GitHub.vscode-pull-request-github
golang.go
GrapeCity.gc-excelviewer
Gruntfuggly.todo-tree
hediet.vscode-drawio
huacnlee.autocorrect
humao.rest-client
ionutvmi.path-autocomplete
jacobdufault.fuzzy-search
JakeBecker.elixir-ls
James-Yu.latex-workshop
jebbs.plantuml
jeff-hykin.better-cpp-syntax
jock.svg
julialang.language-julia
kahole.magit
KevinRose.vsc-python-indent
kisstkondoros.vscode-gutter-preview
KnisterPeter.vscode-commitizen
Lencerf.beancount
llvm-vs-code-extensions.vscode-clangd
marp-team.marp-vscode
mathiassoeholm.markdown-link-updater
mechatroner.rainbow-csv
mervin.markdown-formatter
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.powershell
ms-vscode.remote-explorer
msjsdiag.vscode-react-native
naumovs.color-highlight
ninoseki.vscode-pylens
njpwerner.autodocstring
NomicFoundation.hardhat-solidity
nortakales.vs-qalc
notskm.clang-tidy
oderwat.indent-rainbow
piersdeseilligny.betterfountain
PKief.material-icon-theme
platformio.platformio-ide
pomdtr.excalidraw-editor
qezhu.gitlink
redhat.vscode-xml
redhat.vscode-yaml
REditorSupport.r
Remisa.shellman
Rickaym.manim-sideview
rust-lang.rust-analyzer
serayuzgur.crates
shd101wyy.markdown-preview-enhanced
skn0tt.markdown-link-expander
sswg.swift-lang
tamasfe.even-better-toml
tecosaur.latex-utilities
telesoho.vscode-markdown-paste-image
tensorchord.vscode-envd
timonwong.shellcheck
twxs.cmake
Tyriar.sort-lines
unifiedjs.vscode-mdx
usernamehw.errorlens
vadimcn.vscode-lldb
vintharas.learn-vim
VisualStudioExptTeam.intellicode-api-usage-examples
vscodevim.vim
VSpaceCode.vspacecode
VSpaceCode.whichkey
Vue.volar
xaver.clang-format
XING.zotero-cite
yinfei.luahelper
yy0931.save-as-root
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
