1Password.op-vscode
antfu.file-nesting
antfu.slidev
aster.vscode-subtitles
bierner.markdown-mermaid
bodil.file-browser
Catppuccin.catppuccin-vsc
Catppuccin.catppuccin-vsc-icons
codeandstuff.package-json-upgrade
codezombiech.gitignore
darkriszty.markdown-table-prettify
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
dnicolson.binary-plist
dongfg.vscode-beancount-formatter
eamodio.gitlens
EditorConfig.EditorConfig
EdwinKofler.vscode-assorted-languages
emilast.LogFileHighlighter
esbenp.prettier-vscode
fabiospampinato.vscode-highlight
figma.figma-vscode-extension
formulahendry.code-runner
foxundermoon.shell-format
GitHub.copilot
GitHub.copilot-chat
GitHub.copilot-labs
github.vscode-github-actions
Gruntfuggly.todo-tree
hediet.vscode-drawio
huacnlee.autocorrect
ionutvmi.path-autocomplete
jacobdufault.fuzzy-search
JacobPfeifer.pfeifer-hurl
James-Yu.latex-workshop
julialang.language-julia
kahole.magit
KevinRose.vsc-python-indent
kisstkondoros.vscode-gutter-preview
lehoanganh298.json-lines-viewer
Lencerf.beancount
lmql-team.lmql
marp-team.marp-vscode
mathiassoeholm.markdown-link-updater
mechatroner.rainbow-csv
mhutchie.git-graph
modular-mojotools.vscode-mojo
morph.rift-vscode
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.flake8
ms-python.isort
ms-python.mypy-type-checker
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-server
naumovs.color-highlight
ninoseki.vscode-pylens
njpwerner.autodocstring
nvarner.typst-lsp
oderwat.indent-rainbow
PKief.material-icon-theme
platformio.platformio-ide
pomdtr.excalidraw-editor
qezhu.gitlink
redhat.vscode-xml
redhat.vscode-yaml
REditorSupport.r
Rickaym.manim-sideview
rust-lang.rust-analyzer
serayuzgur.crates
shd101wyy.markdown-preview-enhanced
skn0tt.markdown-link-expander
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tecosaur.latex-utilities
telesoho.vscode-markdown-paste-image
timonwong.shellcheck
twxs.cmake
Tyriar.sort-lines
unifiedjs.vscode-mdx
usernamehw.errorlens
vintharas.learn-vim
VisualStudioExptTeam.intellicode-api-usage-examples
vscodevim.vim
VSpaceCode.vspacecode
VSpaceCode.whichkey
withfig.fig
yy0931.save-as-root
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
