agent-browser
ast-grep
autocorrect
bat
biome
broot
btop
cairo
charmbracelet/tap/crush
cirruslabs/cli/sshpass
cirruslabs/cli/tart
duckdb
eza
fd
ffmpeg
fzf
gh
git-delta
git-lfs
gitu
gnupg
govulncheck
gum
htop
hyperfine
jq
just
k6
lazydocker
lazygit
ls-lint
markdownlint-cli2
mdbook
mise
mole
mosh
mq
mysql-client
neovim
nushell
pkgconf
postgresql@18
prek
psviderski/tap/uncloud
pueue
rclone
rip2
ripsecrets
rjyo/moshi/moshi-hook
rush-parallel
rust-parallel
shellcheck
simonbs/brrr-cli/brrr
skillshare
sqlfluff
sshx
starship
television
tmux
tokei
try-rs
typos-cli
typst
uv
xcodes
xh
yazi
yq
zellij
zoxide
