agent-browser
ast-grep
autocorrect
bat
biome
broot
btop
cairo
duckdb
fd
ffmpeg
fzf
gh
git-delta
gum
htop
hyperfine
jq
k6
lazydocker
lazygit
ls-lint
markdownlint-cli2
mise
mq
mysql-client
neovim
pi-coding-agent
pkgconf
postgresql@18
prek
pueue
rclone
rip2
ripsecrets
shellcheck
simonbs/brrr-cli/brrr
skillshare
starship
stripe/stripe-cli/stripe
television
tmux
tokei
try-rs
typos-cli
uv
xcodes
xh
yazi
yq
zoxide
