bat
btop
cairo
ffmpeg
gh
git-delta
htop
hyperfine
lazydocker
lazygit
mise
mysql-client
neovim
pkgconf
prek
pueue
rip2
simonbs/brrr-cli/brrr
starship
stripe/stripe-cli/stripe
television
tmux
tokei
try-rs
uv
xcodes
xh
yazi
zoxide
