tap "1history/onehistory"
tap "buo/cask-upgrade"
tap "candid82/brew"
tap "cloudflare/cloudflare"
tap "d12frosted/emacs-plus"
tap "espanso/espanso"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "majd/repo"
tap "martido/graph"
tap "oh-my-home/fonts"
tap "railwaycat/emacsmacport"
tap "robotsandpencils/made"
tap "sourcegraph/src-cli"
tap "sunnyyoung/repo"
tap "timothyye/tap"
tap "yqrashawn/goku"
brew "jpeg"
brew "libpng"
brew "aria2"
brew "xz"
brew "asciinema"
brew "asdf"
brew "bandwhich"
brew "bat"
brew "beancount"
brew "broot"
brew "bzip2"
brew "freetype"
brew "cairo"
brew "cmake"
brew "commitizen"
brew "dasel"
brew "direnv"
brew "dog"
brew "duf"
brew "dust"
brew "extra-cmake-modules"
brew "fava"
brew "fcp"
brew "fd"
brew "ffmpeg"
brew "gcc"
brew "fzf"
brew "pcre2"
brew "qt@5"
brew "gdal"
brew "gh"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "git-quick-stats"
brew "gitui"
brew "gnupg"
brew "gping"
brew "pango"
brew "graphviz"
brew "grex"
brew "htop"
brew "hugo"
brew "hyperfine"
brew "iperf"
brew "jpeg-turbo"
brew "jq"
brew "lazydocker"
brew "libxt"
brew "lsd"
brew "m-cli"
brew "mackup"
brew "mas"
brew "mdbook"
brew "micro"
brew "mosh"
brew "navi"
brew "neovim"
brew "nmap"
brew "onefetch"
brew "php"
brew "pipx"
brew "platformio"
brew "qt"
brew "portaudio"
brew "procs"
brew "py3cairo"
brew "pyenv"
brew "r"
brew "ripgrep"
brew "rm-improved"
brew "scipy"
brew "sd"
brew "shellcheck"
brew "smartmontools"
brew "ssh-copy-id"
brew "starship"
brew "subversion"
brew "swig"
brew "tealdeer"
brew "thefuck"
brew "tmate"
brew "tmux"
brew "tokei"
brew "udunits"
brew "vips"
brew "watchexec"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "1history/onehistory/onehistory"
brew "cloudflare/cloudflare/cloudflared"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-nobu417-big-sur-icon"]
brew "eth-p/software/bat-extras"
brew "robotsandpencils/made/xcodes"
brew "sourcegraph/src-cli/src-cli"
brew "timothyye/tap/skm"
brew "yqrashawn/goku/goku"
cask "1password"
cask "1password-cli"
cask "apparency"
cask "athens"
cask "chromium"
cask "clashx-pro"
cask "devtoys"
cask "docker"
cask "espanso"
cask "fig"
cask "font-caskaydia-cove-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-times-new-roman"
cask "ipatool"
cask "latest"
cask "logseq"
cask "mactex"
cask "miniforge"
cask "notion"
cask "obsidian"
cask "openemu"
cask "powershell"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "squirrel"
cask "suspicious-package"
cask "syntax-highlight"
cask "topnotch"
cask "uninstallpkg"
cask "wechattweak-cli"
cask "wezterm"
cask "xld"
cask "xquartz"
cask "zerotier-one"
cask "zulu"
cask "zulu11"
cask "zulu17"
cask "zulu8"
mas "Compressor", id: 424390742
mas "Day One", id: 1055511498
mas "Developer", id: 640199958
mas "Disk Speed Test", id: 425264550
mas "Drafts", id: 1435957248
mas "Eagle for Safari", id: 1526651672
mas "Equinox", id: 1591510203
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "GoodNotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Lattics", id: 1575605022
mas "Logic Pro", id: 634148309
mas "Magnet", id: 441258766
mas "MainStage", id: 634159523
mas "Maipo", id: 789066512
mas "MenubarX", id: 1575588022
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Mini Motorways", id: 1456188526
mas "Money Progress", id: 1614349717
mas "Motion", id: 434290957
mas "MusicHarbor", id: 1440405750
mas "Numbers", id: 409203825
mas "Octotree", id: 1457450145
mas "Pages", id: 409201541
mas "PasteNow", id: 1552536109
mas "Picsee", id: 1454805783
mas "Pixea", id: 1507782672
mas "Plash", id: 1494023538
mas "QQ", id: 451108668
mas "Rayon", id: 1609781496
mas "Refined GitHub", id: 1519867270
mas "Save to Raindrop.io", id: 1549370672
mas "ServerCat", id: 1501532023
mas "Shapr3D", id: 1091675654
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Taio", id: 1527036273
mas "Take a Break", id: 1457158844
mas "Tampermonkey", id: 1482490089
mas "TestFlight", id: 899247664
mas "Tweetbot", id: 1384080005
mas "uBlacklist for Safari", id: 1547912640
mas "uPic", id: 1549159979
mas "Vision", id: 1572457968
mas "waifu2x", id: 1286485858
mas "Xnip", id: 1221250572
mas "讯飞语音输入", id: 1243368435
